InformationRegisters/ПравилаВыгрузкиУправлениеПерсоналом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПравилаВыгрузкиУправлениеПерсоналом</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Приложение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПриложенияДляИнтеграции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ВыгружаемыеОбъектыКабинетСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ВыгружаемыеОбъектыКабинетСотрудника</Name>
			<Comment>Объекты, соответствующие правилам выгрузки</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УсловноВыгружается</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеВыгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыгружаетсяПоСсылке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СсылкаПубликацииКабинетСотрудника</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/АктуальностьИнформацииОбОтпусках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>АктуальностьИнформацииОбОтпусках</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаАктуальности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИзмененияДляОбменаКабинетСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИзмененияДляОбменаКабинетСотрудника</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВерсияДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыгружатьУдаление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СсылкаИзменениеКабинетСотрудника</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбъектовИнтеграцияУправлениеПерсоналом</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИзмененияДанныхГрафикаКабинетСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИзмененияДанныхГрафикаКабинетСотрудника</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВерсияДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БылаОшибкаПриПубликации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИзмененияПлановыхУдержанийДляСервисаКабинетСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИзмененияПлановыхУдержанийДляСервисаКабинетСотрудника</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВерсияДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БылаОшибкаПриПубликации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КатегорияУдержания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииУдержаний</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ВыгруженныеОбъектыУправлениеПерсоналом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ВыгруженныеОбъектыУправлениеПерсоналом</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Выгружался</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СсылкаВыгруженныеОбъектыУправлениеПерсоналом</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Приложение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПриложенияДляИнтеграции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбъектовИнтеграцияУправлениеПерсоналом</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/УдалитьСотрудникиДляОбновленияПубликацииГрафикаОтпусков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>УдалитьСотрудникиДляОбновленияПубликацииГрафикаОтпусков</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВерсияДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БылаОшибкаПриПубликации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/УдалитьСотрудникиДляОбновленияПубликацииПравНаОтпуск.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>УдалитьСотрудникиДляОбновленияПубликацииПравНаОтпуск</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВерсияДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БылаОшибкаПриПубликации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/УдалитьАктуальностьИнформацииОбОтпуске.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>УдалитьАктуальностьИнформацииОбОтпуске</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаАктуальности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ИнтеграцияКабинетСотрудникаРасширенный/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ПеренестиЗаработанныеПраваНаОтпуск");
	Методы.Вставить("ОбновитьРегистрациюДанныхАнтропометрии");
	Методы.Вставить("ПеренестиАктуальностьИнформацииОбОтпусках");
	Методы.Вставить("НастроитьРегламентноеЗаданиеПроверкаАктуальностиЗаработанныхПравНаОтпуск");
	Методы.Вставить("ОбновитьРегистрациюСИЗ");
	Методы.Вставить("ЗарегистрироватьОбновлениеНастроекФункциональности");
	Методы.Вставить("ПереносИзмененияДляОбменаКабинетСотрудника");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Устанавливает значение для ФО ПоказыватьПриглашениеКабинетСотрудника
//
//	Параметры:
//		ВыполняетсяНачальнаяНастройка - Булево.
//
Процедура ОбработатьИзменениеВыполняетсяНачальнаяНастройка(ВыполняетсяНачальнаяНастройка) Экспорт

	ПоказыватьПриглашение = Не (ВыполняетсяНачальнаяНастройка Или ПолучитьФункциональнуюОпцию("ИспользуетсяСервисКабинетСотрудника"));
	Если ПоказыватьПриглашение <> Константы.ПоказыватьПриглашениеКабинетСотрудника.Получить() Тогда
		Константы.ПоказыватьПриглашениеКабинетСотрудника.Установить(ПоказыватьПриглашение);
	КонецЕсли;
	
КонецПроцедуры

Функция ДоступноИспользованиеСборГрафиковОтпусков() Экспорт

	Если Не ПолучитьФункциональнуюОпцию("ИспользуетсяСервисКабинетСотрудника") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ИнтеграцияКабинетСотрудника.ИспользуетсяВерсияDTO("1.1");

КонецФункции

#Область ОбновлениеИнформационнойБазы

// См. ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления.
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия          = "3.1.27.85";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура       = "ИнтеграцияКабинетСотрудникаРасширенный.ПереносИзмененияДляОбменаКабинетСотрудника";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия          = "3.1.32.14";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура       = "ИнтеграцияКабинетСотрудникаРасширенный.ПеренестиЗаработанныеПраваНаОтпуск";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия          = "3.1.32.14";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Процедура       = "ИнтеграцияКабинетСотрудникаРасширенный.ПеренестиАктуальностьИнформацииОбОтпусках";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия          = "3.1.36.6";
	Обработчик.РежимВыполнения = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОсновнойРежимВыполненияОбновления();
	Обработчик.Идентификатор   = Новый УникальныйИдентификатор("6cd9f4f3-ecdc-4508-a3f9-28cc25ce0f25");
	Обработчик.Процедура       = "ИнтеграцияКабинетСотрудникаРасширенный.НастроитьРегламентноеЗаданиеПроверкаАктуальностиЗаработанныхПравНаОтпуск";
	Обработчик.Комментарий     = НСтр("ru = 'Настройка регламентного задания Проверка актуальности заработанных прав на отпуск.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия          = "3.1.37.6";
	Обработчик.РежимВыполнения = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОсновнойРежимВыполненияОбновления();
	Обработчик.Идентификатор   = Новый УникальныйИдентификатор("aba8aee8-28a5-47f7-bc75-9b5a966c97fb");
	Обработчик.Процедура       = "ИнтеграцияКабинетСотрудникаРасширенный.ЗарегистрироватьОбновлениеНастроекФункциональности";
	Обработчик.Комментарий     = НСтр("ru = 'Регистрация обновления настроек функциональности сервиса 1С:Кабинет сотрудника.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия 			= "3.1.37.61";
	Обработчик.Процедура 		= "ИнтеграцияКабинетСотрудникаРасширенный.ОбновитьРегистрациюСИЗ";
	Обработчик.РежимВыполнения 	= "Отложенно";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор("45fcab75-ce21-4343-9b7f-d410db3005b0");
	Обработчик.Комментарий 		= НСтр("ru = 'Обновление регистрации данных СИЗ для сервиса 1С:Кабинет сотрудника.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия 			= "3.1.37.61";
	Обработчик.Процедура 		= "ИнтеграцияКабинетСотрудникаРасширенный.ОбновитьРегистрациюДанныхАнтропометрии";
	Обработчик.РежимВыполнения 	= "Отложенно";
	Обработчик.Идентификатор 	= Новый УникальныйИдентификатор("00a555ca-6c95-4158-a126-48c5de74388a");
	Обработчик.Комментарий 		= НСтр("ru = 'Обновление регистрации данных антропометрии для сервиса 1С:Кабинет сотрудника.'");
	
КонецПроцедуры

#КонецОбласти

Функция ПодразделенияПравилДляСбораГрафикаОтпусков() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Приложение", Перечисления.ПриложенияДляИнтеграции.КабинетСотрудника);
	
	Подразделения = Новый Массив;
	
	Если ИнтеграцияУправлениеПерсоналом.ПубликоватьСтруктуруЮридическихЛиц() Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Правила.Ссылка КАК Ссылка
		|ИЗ
		|	РегистрСведений.ПравилаВыгрузкиУправлениеПерсоналом КАК Правила
		|ГДЕ
		|	Правила.Приложение = &Приложение
		|	И Правила.Ссылка ССЫЛКА Справочник.ПодразделенияОрганизаций";
		УстановитьПривилегированныйРежим(Истина);
		Подразделения = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		УстановитьПривилегированныйРежим(Ложь);
		Запрос.УстановитьПараметр("Подразделения", Подразделения);
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Подразделения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ПодразделенияОрганизаций КАК Подразделения
		|ГДЕ
		|	Подразделения.Ссылка В(&Подразделения)";
		Подразделения = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Правила.Ссылка КАК Ссылка
		|ИЗ
		|	РегистрСведений.ПравилаВыгрузкиУправлениеПерсоналом КАК Правила
		|ГДЕ
		|	Правила.Приложение = &Приложение
		|	И Правила.Ссылка ССЫЛКА Справочник.ШтатноеРасписание";
		УстановитьПривилегированныйРежим(Истина);
		ПозицииШР = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		МестаПозицийВСтруктуреПредприятия = ИнтеграцияУправлениеПерсоналомРасширенный.МестаПозицийВСтруктуреПредприятия(ПозицииШР);
		УстановитьПривилегированныйРежим(Ложь);
		Подразделения = ОбщегоНазначения.ВыгрузитьКолонку(МестаПозицийВСтруктуреПредприятия,"Подразделение", Истина);
		Запрос.УстановитьПараметр("Подразделения", Подразделения);
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Подразделения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СтруктураПредприятия КАК Подразделения
		|ГДЕ
		|	Подразделения.Ссылка В(&Подразделения)";
		Подразделения = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
	
	Возврат Подразделения;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// См. РегламентныеЗаданияПереопределяемый.ПриОпределенииНастроекРегламентныхЗаданий
Процедура ПриОпределенииНастроекРегламентныхЗаданий(Настройки) Экспорт
	
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.ПроверкаАктуальностиЗаработанныхПравНаОтпуск;
	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.ИспользуетсяСервисКабинетСотрудника;
	Настройка.ДоступноВАвтономномРабочемМесте = Ложь;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;
	
КонецПроцедуры

// См. ОчередьЗаданийПереопределяемый.ПриПолученииСпискаШаблонов.
//
Процедура ПриПолученииСпискаШаблоновОчередиЗаданий(Шаблоны) Экспорт
	
	Шаблоны.Добавить(Метаданные.РегламентныеЗадания.ПроверкаАктуальностиЗаработанныхПравНаОтпуск.Имя);
	
КонецПроцедуры

// См. ОчередьЗаданийПереопределяемый.ПриОпределенииПсевдонимовОбработчиков.
//
Процедура ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам) Экспорт
	
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.ПроверкаАктуальностиЗаработанныхПравНаОтпуск.ИмяМетода);
	
КонецПроцедуры

// Процедура регламентного задания ПроверкаАктуальностиЗаработанныхПравНаОтпуск
//
Процедура ПроверкаАктуальностиЗаработанныхПравНаОтпуск() Экспорт 
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ПроверкаАктуальностиЗаработанныхПравНаОтпуск);
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Проверка физических лиц, которые не зарегистрированы для проверки актуальности отпусков.
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Сотрудники.ФизическоеЛицо КАК Ссылка
	|ПОМЕСТИТЬ ВТФизическиеЛица
	|ИЗ
	|	РегистрСведений.ВыгружаемыеОбъектыКабинетСотрудника КАК ВыгружаемыеСотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО ВыгружаемыеСотрудники.Ссылка = Сотрудники.Ссылка
	|ГДЕ
	|	НЕ ВыгружаемыеСотрудники.ВыгружаетсяПоСсылке
	|	И НЕ ВыгружаемыеСотрудники.УсловноВыгружается
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФизическиеЛица.Ссылка КАК Ссылка
	|ИЗ
	|	ВТФизическиеЛица КАК ФизическиеЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АктуальностьИнформацииОбОтпусках КАК АктуальностьИнформацииОбОтпусках
	|		ПО ФизическиеЛица.Ссылка = АктуальностьИнформацииОбОтпусках.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИзмененияДляОбменаКабинетСотрудника КАК Изменения
	|		ПО ФизическиеЛица.Ссылка = Изменения.Ссылка
	|			И (Изменения.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовИнтеграцияУправлениеПерсоналом.ЗаработанныеПраваНаОтпуск))
	|ГДЕ
	|	АктуальностьИнформацииОбОтпусках.ДатаАктуальности ЕСТЬ NULL
	|	И Изменения.ВерсияДанных ЕСТЬ NULL";
	ФизическиеЛицаБезАктуализации = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Для каждого ФизическоеЛицо Из ФизическиеЛицаБезАктуализации Цикл
		МенеджерЗаписи = РегистрыСведений.ИзмененияДляОбменаКабинетСотрудника.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Ссылка 		= ФизическоеЛицо;
		МенеджерЗаписи.ТипОбъекта 	= Перечисления.ТипыОбъектовИнтеграцияУправлениеПерсоналом.ЗаработанныеПраваНаОтпуск;
		МенеджерЗаписи.ВерсияДанных = Строка(Новый УникальныйИдентификатор);
		МенеджерЗаписи.Записать();
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДатаСеанса()));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА ВыгружаемыеОбъекты.УсловноВыгружается ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Выгружается
	|ИЗ
	|	РегистрСведений.АктуальностьИнформацииОбОтпусках КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВыгружаемыеОбъектыКабинетСотрудника КАК ВыгружаемыеОбъекты
	|		ПО Таблица.ФизическоеЛицо = ВыгружаемыеОбъекты.Ссылка
	|ГДЕ
	|	Таблица.ДатаАктуальности <= &ТекущаяДата";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Выгружается Тогда
			МенеджерЗаписи = РегистрыСведений.ИзмененияДляОбменаКабинетСотрудника.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Ссылка 		= Выборка.ФизическоеЛицо;
			МенеджерЗаписи.ТипОбъекта 	= Перечисления.ТипыОбъектовИнтеграцияУправлениеПерсоналом.ЗаработанныеПраваНаОтпуск;
			МенеджерЗаписи.ВерсияДанных = Строка(Новый УникальныйИдентификатор);
			МенеджерЗаписи.Записать();
		КонецЕсли;
		НаборЗаписей = РегистрыСведений.АктуальностьИнформацииОбОтпусках.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ФизическоеЛицо.Установить(Выборка.ФизическоеЛицо);
		НаборЗаписей.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьЭлементыБлокировкиПриСохраненииПравилВыгрузки(Блокировка) Экспорт

	Блокировка.Добавить("РегистрСведений.ИзмененияДанныхГрафикаКабинетСотрудника");

КонецПроцедуры

Процедура ЗаписатьОбъектыДляОбменаПриСохраненииПравилВыгрузки(ОбъектыДляРегистрации) Экспорт
	
	Если Не ЗначениеЗаполнено(ОбъектыДляРегистрации) Тогда
		Возврат;
	КонецЕсли;
	
	ИзмененияДанныхГрафика = Неопределено;
	ОбъектыДляРегистрации.Свойство("ИзмененияДанныхГрафика", ИзмененияДанныхГрафика);
	Если ЗначениеЗаполнено(ИзмененияДанныхГрафика) Тогда
		НаборЗаписей = РегистрыСведений.ИзмененияДанныхГрафикаКабинетСотрудника.СоздатьНаборЗаписей();
		Для каждого СтрокаТЗ Из ИзмененияДанныхГрафика Цикл
			ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), СтрокаТЗ);
		КонецЦикла;
		НаборЗаписей.Записать(); 
	КонецЕсли;

КонецПроцедуры

Процедура ДобавитьБлокировкуРегистрацияОбъектовДляОбмена(Блокировка, ОбъектыДляРегистрации) Экспорт

	ИзмененияДанныхГрафика = Неопределено;
	ОбъектыДляРегистрации.Свойство("ИзмененияДанныхГрафика", ИзмененияДанныхГрафика);
	Если ЗначениеЗаполнено(ИзмененияДанныхГрафика) Тогда
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ИзмененияДанныхГрафикаКабинетСотрудника");
		ЭлементБлокировки.ИсточникДанных = ИзмененияДанныхГрафика;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ГрафикРаботы", "ГрафикРаботы");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Год", "Год");
	КонецЕсли;

КонецПроцедуры

Процедура ЗаписатьОбъектыДляОбмена(ОбъектыДляРегистрации) Экспорт
	
	Если Не ЗначениеЗаполнено(ОбъектыДляРегистрации) Тогда
		Возврат;
	КонецЕсли;
	
	ИзмененияДанныхГрафика = Неопределено;
	ОбъектыДляРегистрации.Свойство("ИзмененияДанныхГрафика", ИзмененияДанныхГрафика);
	Если ЗначениеЗаполнено(ИзмененияДанныхГрафика) Тогда
		Для каждого СтрокаТЗ Из ИзмененияДанныхГрафика Цикл
			МенеджерЗаписи = РегистрыСведений.ИзмененияДанныхГрафикаКабинетСотрудника.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтрокаТЗ);
			МенеджерЗаписи.Записать();
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Функция РассчитатьИзмененияДанныхГрафика(ГрафикиРаботыСотрудников) Экспорт
	
	Если Не ЗначениеЗаполнено(ГрафикиРаботыСотрудников) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Приложение = Перечисления.ПриложенияДляИнтеграции.КабинетСотрудника;
	ТекущиеВыгружаемыеГрафикиРаботы = ИнтеграцияУправлениеПерсоналом.ОбъектыВыгружаютсяВПриложение(ГрафикиРаботыСотрудников, Приложение);
	НовыеГрафикиРаботы = ОбщегоНазначенияКлиентСервер.РазностьМассивов(ГрафикиРаботыСотрудников, ТекущиеВыгружаемыеГрафикиРаботы); 
	
	ИзмененияДанныхГрафика = ОбщегоНазначенияБЗК.ТаблицаЗначенийПоИмениРегистраСведений("ИзмененияДанныхГрафикаКабинетСотрудника");
	ТекущийГод = Год(ТекущаяДатаСеанса());
	Для каждого ГрафикРаботы Из НовыеГрафикиРаботы Цикл
		НоваяСтрока = ИзмененияДанныхГрафика.Добавить();
		НоваяСтрока.ГрафикРаботы 	= ГрафикРаботы;
		НоваяСтрока.Год 			= ТекущийГод;
		НоваяСтрока.ВерсияДанных 	= Строка(Новый УникальныйИдентификатор);
	КонецЦикла;
	
	Возврат ИзмененияДанныхГрафика;
	
КонецФункции

Процедура ОчиститьДанныеПриОтключенииПриложения() Экспорт

	РегистрыСведений.АктуальностьИнформацииОбОтпусках.СоздатьНаборЗаписей().Записать();
	РегистрыСведений.ИзмененияДанныхГрафикаКабинетСотрудника.СоздатьНаборЗаписей().Записать();
	РегистрыСведений.ИзмененияПлановыхУдержанийДляСервисаКабинетСотрудника.СоздатьНаборЗаписей().Записать();
	
	Параметры = Новый Структура("ИспользоватьСборДанныхДляОформленияНаРаботу", Ложь);
	ИнтеграцияУправлениеПерсоналомРасширенный.УстановитьИспользованиеРешенияОПриемеНаРаботу(Параметры);

КонецПроцедуры

Процедура ТипыОбъектовДляРучнойРегистрацииИзменений(ТипыОбъектов) Экспорт
	
	НоваяСтрока = ТипыОбъектов.Добавить();
	НоваяСтрока.ТипОбъекта 	= Перечисления.ТипыОбъектовИнтеграцияУправлениеПерсоналом.ГрафикОтпусков;
	НоваяСтрока.ИмяТаблицы 	= ОбщегоНазначения.ИмяТаблицыПоСсылке(Справочники.Сотрудники.ПустаяСсылка());
	
	НоваяСтрока = ТипыОбъектов.Добавить();
	НоваяСтрока.ТипОбъекта 	= Перечисления.ТипыОбъектовИнтеграцияУправлениеПерсоналом.ЗаработанныеПраваНаОтпуск;
	НоваяСтрока.ИмяТаблицы 	= ОбщегоНазначения.ИмяТаблицыПоСсылке(Справочники.ФизическиеЛица.ПустаяСсылка());
	
	НоваяСтрока = ТипыОбъектов.Добавить();
	НоваяСтрока.ТипОбъекта 	= Перечисления.ТипыОбъектовИнтеграцияУправлениеПерсоналом.ПраздничныеДниГрафикаРаботы;
	НоваяСтрока.ИмяТаблицы 	= ОбщегоНазначения.ИмяТаблицыПоСсылке(Справочники.ГрафикиРаботыСотрудников.ПустаяСсылка());
	
	Если КабинетСотрудника.ИспользоватьФормат50375() Тогда
		ИмяОпции = "ИспользоватьЗапросыСправокСотрудником";
		ФункциональнаяОпцияИспользуется = (Метаданные.ФункциональныеОпции.Найти(ИмяОпции) <> Неопределено);
		Если ФункциональнаяОпцияИспользуется И ПолучитьФункциональнуюОпцию(ИмяОпции) Тогда
			ТипЗначения = ИнтеграцияУправлениеПерсоналом.ТипВидПредоставляемойСотрудникамСправкиСсылка();
			Если ЗначениеЗаполнено(ТипЗначения) Тогда
				ИмяТаблицы = Метаданные.НайтиПоТипу(ТипЗначения).ПолноеИмя();
				НоваяСтрока = ТипыОбъектов.Добавить();
				НоваяСтрока.ТипОбъекта 	= Перечисления.ТипыОбъектовИнтеграцияУправлениеПерсоналом.ВидПредоставляемойСотрудникамСправки;
				НоваяСтрока.ИмяТаблицы 	= ИмяТаблицы;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ИнтеграцияКабинетСотрудника.ИспользуетсяВерсияDTO("3.0") Тогда
		НоваяСтрока = ТипыОбъектов.Добавить();
		НоваяСтрока.ТипОбъекта 	= Перечисления.ТипыОбъектовИнтеграцияУправлениеПерсоналом.ВидОтпуска;
		НоваяСтрока.ИмяТаблицы 	= ОбщегоНазначения.ИмяТаблицыПоСсылке(Справочники.ВидыОтпусков.ПустаяСсылка());
		Если ИнтеграцияКабинетСотрудника.ИспользоватьРабочиеМестаОхраныТруда() Тогда
			ТипЗначения = ИнтеграцияУправлениеПерсоналомРасширенный.ТипРабочиеМестаОхраныТрудаСсылка();
			Если ТипЗначения <> Тип("Неопределено") Тогда
				НоваяСтрока = ТипыОбъектов.Добавить();
				НоваяСтрока.ТипОбъекта = Перечисления.ТипыОбъектовИнтеграцияУправлениеПерсоналом.РабочееМестоОхраныТруда;
				НоваяСтрока.ИмяТаблицы = Метаданные.НайтиПоТипу(ТипЗначения).ПолноеИмя();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ИнтеграцияКабинетСотрудника.ИспользуетсяВерсияDTO("3.1") Тогда
		Если ИнтеграцияКабинетСотрудника.ИспользоватьМедицинскиеОсмотры()
			Или ИнтеграцияКабинетСотрудника.ИспользоватьПсихиатрическиеОсвидетельствования() Тогда
			НоваяСтрока = ТипыОбъектов.Добавить();
			НоваяСтрока.ТипОбъекта = Перечисления.ТипыОбъектовИнтеграцияУправлениеПерсоналом.МедицинскиеОсмотры;
			НоваяСтрока.ИмяТаблицы = ОбщегоНазначения.ИмяТаблицыПоСсылке(Справочники.ФизическиеЛица.ПустаяСсылка());
		КонецЕсли;
		Если ИнтеграцияКабинетСотрудника.ИспользоватьСредстваИндивидуальнойЗащиты() Тогда
			НоваяСтрока = ТипыОбъектов.Добавить();
			НоваяСтрока.ТипОбъекта = Перечисления.ТипыОбъектовИнтеграцияУправлениеПерсоналом.ИнформацияОСредствахИЗ;
			НоваяСтрока.ИмяТаблицы = ОбщегоНазначения.ИмяТаблицыПоСсылке(Справочники.ФизическиеЛица.ПустаяСсылка());
			НоваяСтрока = ТипыОбъектов.Добавить();
			НоваяСтрока.ТипОбъекта = Перечисления.ТипыОбъектовИнтеграцияУправлениеПерсоналом.Антропометрия;
			НоваяСтрока.ИмяТаблицы = ОбщегоНазначения.ИмяТаблицыПоСсылке(Справочники.ФизическиеЛица.ПустаяСсылка());
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция НастройкиРасчетаЗарплаты() Экспорт

	УстановитьПривилегированныйРежим(Истина);
	Возврат РасчетЗарплатыРасширенный.НастройкиРасчетаЗарплаты();

КонецФункции

Процедура ВключитьСборГрафиковОтпусков() Экспорт

	СборГрафиковОтпусков.УстановитьЗначениеИспользоватьСборГрафиковОтпусков(Истина);

КонецПроцедуры

Процедура ЗарегистрироватьИзмененияПлановыхУдержаний() Экспорт
	
	ИмяОбработчика = ИнтеграцияКабинетСотрудника.ИмяОбработчикаЗарегистрироватьИзмененияПлановыхУдержаний();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВыгружаемыеОбъекты.Ссылка КАК ФизическоеЛицо
	|ИЗ
	|	РегистрСведений.ВыгружаемыеОбъектыКабинетСотрудника КАК ВыгружаемыеОбъекты
	|ГДЕ
	|	ВыгружаемыеОбъекты.Ссылка ССЫЛКА Справочник.ФизическиеЛица
	|	И НЕ ВыгружаемыеОбъекты.УсловноВыгружается";
	ФизическиеЛица = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ФизическоеЛицо");
	Если ФизическиеЛица.Количество() = 0 Тогда
		ИнтеграцияКабинетСотрудника.ОтключитьОбработчикОбмена(ИмяОбработчика);
		Возврат;
	КонецЕсли;
	
	ПараметрыПолучения = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолучения.СписокФизическихЛиц = ФизическиеЛица;
	ПараметрыПолучения.КадровыеДанные = "Организация";
	ДанныеДляРегистрации = ИнтеграцияУправлениеПерсоналом.КадровыеДанныеСотрудников(ПараметрыПолучения);
	ДанныеДляРегистрации.Свернуть("Организация,ФизическоеЛицо");
	ДанныеДляРегистрации.Колонки.Добавить("КатегорияУдержания", Новый ОписаниеТипов("ПеречислениеСсылка.КатегорииУдержаний"));
	ДанныеДляРегистрации.ЗаполнитьЗначения(Перечисления.КатегорииУдержаний.ДСВ,"КатегорияУдержания");
	
	НачатьТранзакцию();
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ИзмененияПлановыхУдержанийДляСервисаКабинетСотрудника");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИсточникДанных = ДанныеДляРегистрации;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Организация", "Организация");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ФизическоеЛицо", "ФизическоеЛицо");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("КатегорияУдержания", "КатегорияУдержания");
		Блокировка.Заблокировать();
		
		Для каждого СтрокаТЗ Из ДанныеДляРегистрации Цикл
			МенеджерЗаписи = РегистрыСведений.ИзмененияПлановыхУдержанийДляСервисаКабинетСотрудника.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Организация 			= СтрокаТЗ.Организация;
			МенеджерЗаписи.ФизическоеЛицо 		= СтрокаТЗ.ФизическоеЛицо;
			МенеджерЗаписи.КатегорияУдержания 	= СтрокаТЗ.КатегорияУдержания;
			МенеджерЗаписи.ВерсияДанных 		= Строка(Новый УникальныйИдентификатор);
			МенеджерЗаписи.Записать();
		КонецЦикла;
		
		ИнтеграцияКабинетСотрудника.ОтключитьОбработчикОбмена(ИмяОбработчика);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
	КонецПопытки;

КонецПроцедуры

Процедура ОбновитьАктуальностьИнформацииОбОтпусках(ФизическиеЛица, АктуальностьИнформацииОбОтпусках) Экспорт
	
	ФизическиеЛицаКОбработке = ОбщегоНазначенияБЗККлиентСервер.МассивВСоответствие(ФизическиеЛица);
	
	ТаблицаАктуальности = АктуальностьИнформацииОбОтпусках.СкопироватьКолонки();
	Для каждого СтрокаТЗ Из АктуальностьИнформацииОбОтпусках Цикл
		Если ФизическиеЛицаКОбработке[СтрокаТЗ.ФизическоеЛицо] = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ТаблицаАктуальности.Добавить(), СтрокаТЗ);
	КонецЦикла; 
	
	Если Не ЗначениеЗаполнено(ТаблицаАктуальности) Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.АктуальностьИнформацииОбОтпусках");
		ЭлементБлокировки.ИсточникДанных = ТаблицаАктуальности;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ФизическоеЛицо", "ФизическоеЛицо");
		Блокировка.Заблокировать();
		
		Для каждого СтрокаТЗ Из ТаблицаАктуальности Цикл
			МенеджерЗаписи = РегистрыСведений.АктуальностьИнформацииОбОтпусках.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтрокаТЗ);
			МенеджерЗаписи.Записать();
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
	КонецПопытки;

КонецПроцедуры

Функция ДоступноИспользованиеОхраныТруда() Экспорт
	
	// Доступность определяется настройкой использования рабочих мест охраны труда.
	Возврат ДоступноИспользованиеРабочихМестОхраныТруда();

КонецФункции

Функция ДоступноИспользованиеРабочихМестОхраныТруда() Экспорт
	
	Возврат РабочиеМестаОхраныТруда.РабочиеМестаОхраныТрудаИспользуются();

КонецФункции

Функция ДоступноИспользованиеМедицинскихОсмотров() Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ОхранаТруда.МедицинскиеОсмотры") Тогда
		МодульМедицинскиеОсмотры = ОбщегоНазначения.ОбщийМодуль("МедицинскиеОсмотры");
		Возврат МодульМедицинскиеОсмотры.МедицинскиеОсмотрыИспользуются();
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции

Функция ДоступноИспользованиеПсихиатрическихОсвидетельствований() Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ОхранаТруда.МедицинскиеОсмотры") Тогда
		МодульМедицинскиеОсмотры = ОбщегоНазначения.ОбщийМодуль("МедицинскиеОсмотры");
		Возврат МодульМедицинскиеОсмотры.ПсихиатрическиеОсвидетельствованияИспользуются();
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции

Функция ДоступноИспользованиеСредствИндивидуальнойЗащиты() Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ОхранаТруда.СредстваИндивидуальнойЗащиты") Тогда
		МодульСредстваИндивидуальнойЗащиты = ОбщегоНазначения.ОбщийМодуль("СредстваИндивидуальнойЗащиты");
		Возврат МодульСредстваИндивидуальнойЗащиты.СредстваИндивидуальнойЗащитыИспользуются();
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции

#Область ПолучениеИзменений

Функция ИзмененияДанныхГрафиковРаботы() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Изменения.ГрафикРаботы КАК ГрафикРаботы,
	|	Изменения.Год КАК Год,
	|	Изменения.ВерсияДанных КАК ВерсияДанных,
	|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), ГОД, Изменения.Год - 1), ГОД) КАК ДатаНачала,
	|	КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), ГОД, Изменения.Год - 1), ГОД) КАК ДатаОкончания,
	|	ВЫБОР
	|		КОГДА ВыгружаемыеОбъекты.УсловноВыгружается ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьВПравилах,
	|	ЕСТЬNULL(ВыгруженныеОбъекты.Выгружался, ЛОЖЬ) КАК ГрафикВыгружался
	|ИЗ
	|	РегистрСведений.ИзмененияДанныхГрафикаКабинетСотрудника КАК Изменения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВыгружаемыеОбъектыКабинетСотрудника КАК ВыгружаемыеОбъекты
	|		ПО Изменения.ГрафикРаботы = ВыгружаемыеОбъекты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВыгруженныеОбъектыУправлениеПерсоналом КАК ВыгруженныеОбъекты
	|		ПО Изменения.ГрафикРаботы = ВыгруженныеОбъекты.Ссылка
	|			И (ВыгруженныеОбъекты.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовИнтеграцияУправлениеПерсоналом.ГрафикРаботы))
	|			И (ВыгруженныеОбъекты.Приложение = ЗНАЧЕНИЕ(Перечисление.ПриложенияДляИнтеграции.КабинетСотрудника))
	|			И (ВыгруженныеОбъекты.Выгружался)";
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Функция ИзмененияПлановыхУдержаний() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 500
	|	Изменения.Организация КАК Организация,
	|	Изменения.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Изменения.КатегорияУдержания КАК КатегорияУдержания,
	|	Изменения.ВерсияДанных КАК ВерсияДанных,
	|	ВЫБОР
	|		КОГДА ВыгружаемыеФизическиеЛица.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		КОГДА ВыгружаемыеОрганизации.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьВПравилах
	|ИЗ
	|	РегистрСведений.ИзмененияПлановыхУдержанийДляСервисаКабинетСотрудника КАК Изменения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВыгружаемыеОбъектыКабинетСотрудника КАК ВыгружаемыеФизическиеЛица
	|		ПО Изменения.ФизическоеЛицо = ВыгружаемыеФизическиеЛица.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВыгружаемыеОбъектыКабинетСотрудника КАК ВыгружаемыеОрганизации
	|		ПО Изменения.Организация = ВыгружаемыеОрганизации.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВыгруженныеОбъектыУправлениеПерсоналом КАК ВыгруженныеФизическиеЛица
	|		ПО Изменения.ФизическоеЛицо = ВыгруженныеФизическиеЛица.Ссылка
	|			И (ВыгруженныеФизическиеЛица.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовИнтеграцияУправлениеПерсоналом.ФизическоеЛицо))
	|			И (ВыгруженныеФизическиеЛица.Приложение = ЗНАЧЕНИЕ(Перечисление.ПриложенияДляИнтеграции.КабинетСотрудника))
	|			И (ВыгруженныеФизическиеЛица.Выгружался)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВыгруженныеОбъектыУправлениеПерсоналом КАК ВыгруженныеОрганизации
	|		ПО Изменения.Организация = ВыгруженныеОрганизации.Ссылка
	|			И (ВыгруженныеОрганизации.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовИнтеграцияУправлениеПерсоналом.Организация))
	|			И (ВыгруженныеОрганизации.Приложение = ЗНАЧЕНИЕ(Перечисление.ПриложенияДляИнтеграции.КабинетСотрудника))
	|			И (ВыгруженныеОрганизации.Выгружался)";
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

#КонецОбласти

#Область ОтменаРегистрацииИзменений

Процедура ОтменитьРегистрациюИзмененийДанныхГрафиковРаботы(ОтменитьРегистрацию) Экспорт

	НачатьТранзакцию();
	Попытка
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ИзмененияДанныхГрафикаКабинетСотрудника");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИсточникДанных = ОтменитьРегистрацию;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ГрафикРаботы", "ГрафикРаботы");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Год", "Год");
		Блокировка.Заблокировать();
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ОтменитьРегистрацию", ОтменитьРегистрацию);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаИзменений.ГрафикРаботы КАК ГрафикРаботы,
		|	ТаблицаИзменений.Год КАК Год,
		|	ТаблицаИзменений.ВерсияДанных КАК ВерсияДанных
		|ПОМЕСТИТЬ ОтменитьРегистрацию
		|ИЗ
		|	&ОтменитьРегистрацию КАК ТаблицаИзменений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОтменитьРегистрацию.ГрафикРаботы КАК ГрафикРаботы,
		|	ОтменитьРегистрацию.Год КАК Год
		|ИЗ
		|	ОтменитьРегистрацию КАК ОтменитьРегистрацию
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИзмененияДанныхГрафикаКабинетСотрудника КАК Изменения
		|		ПО ОтменитьРегистрацию.ГрафикРаботы = Изменения.ГрафикРаботы
		|			И ОтменитьРегистрацию.Год = Изменения.Год
		|			И ОтменитьРегистрацию.ВерсияДанных = Изменения.ВерсияДанных";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			МенеджерЗаписи = РегистрыСведений.ИзмененияДанныхГрафикаКабинетСотрудника.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.ГрафикРаботы = Выборка.ГрафикРаботы;
			МенеджерЗаписи.Год = Выборка.Год;
			МенеджерЗаписи.Удалить();
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ШаблонОписания = НСтр("ru = 'Ошибка отмены регистрации изменений данных графиков работы.
			|%1'");
		ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Комментарий = СтрШаблон(ШаблонОписания, ПодробноеПредставлениеОшибки);
		Приложение = Перечисления.ПриложенияДляИнтеграции.КабинетСотрудника;
		ИмяСобытия = ИнтеграцияУправлениеПерсоналом.ИменаСобытийЖР(Приложение).Обмен;
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, Комментарий);
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

Процедура ОтменитьРегистрациюИзмененийПлановыхУдержаний(ОтменитьРегистрацию) Экспорт

	НачатьТранзакцию();
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ИзмененияПлановыхУдержанийДляСервисаКабинетСотрудника");
		ЭлементБлокировки.ИсточникДанных = ОтменитьРегистрацию;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Организация", "Организация");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ФизическоеЛицо", "ФизическоеЛицо");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("КатегорияУдержания", "КатегорияУдержания");
		Блокировка.Заблокировать();
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ОтменитьРегистрацию", ОтменитьРегистрацию);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтменитьРегистрацию.Организация КАК Организация,
		|	ОтменитьРегистрацию.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ОтменитьРегистрацию.КатегорияУдержания КАК КатегорияУдержания,
		|	ОтменитьРегистрацию.ВерсияДанных КАК ВерсияДанных
		|ПОМЕСТИТЬ ВТОтменитьРегистрацию
		|ИЗ
		|	&ОтменитьРегистрацию КАК ОтменитьРегистрацию
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОтменитьРегистрацию.Организация КАК Организация,
		|	ОтменитьРегистрацию.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ОтменитьРегистрацию.КатегорияУдержания КАК КатегорияУдержания
		|ИЗ
		|	ВТОтменитьРегистрацию КАК ОтменитьРегистрацию
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИзмененияПлановыхУдержанийДляСервисаКабинетСотрудника КАК ИзмененияПлановыхУдержаний
		|		ПО ОтменитьРегистрацию.Организация = ИзмененияПлановыхУдержаний.Организация
		|			И ОтменитьРегистрацию.ФизическоеЛицо = ИзмененияПлановыхУдержаний.ФизическоеЛицо
		|			И ОтменитьРегистрацию.КатегорияУдержания = ИзмененияПлановыхУдержаний.КатегорияУдержания
		|			И ОтменитьРегистрацию.ВерсияДанных = ИзмененияПлановыхУдержаний.ВерсияДанных";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			МенеджерЗаписи = РегистрыСведений.ИзмененияПлановыхУдержанийДляСервисаКабинетСотрудника.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Организация 			= Выборка.Организация;
			МенеджерЗаписи.ФизическоеЛицо 		= Выборка.ФизическоеЛицо;
			МенеджерЗаписи.КатегорияУдержания 	= Выборка.КатегорияУдержания;
			МенеджерЗаписи.Удалить();
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ШаблонОписания = НСтр("ru = 'Ошибка отмены регистрации изменений Плановых удержаний.
			|%1'");
		ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Комментарий = СтрШаблон(ШаблонОписания, ПодробноеПредставлениеОшибки);
		Приложение = Перечисления.ПриложенияДляИнтеграции.КабинетСотрудника;
		ИмяСобытия = ИнтеграцияУправлениеПерсоналом.ИменаСобытийЖР(Приложение).Обмен;
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, Комментарий);
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

#КонецОбласти

#Область ОбновлениеИБ

#Область ПереносДанных

Процедура ПереносИзмененияДляОбменаКабинетСотрудника() Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользуетсяСервисКабинетСотрудника") Тогда
		Возврат;
	КонецЕсли;
	
	ИзмененияДляОбмена = ИнтеграцияКабинетСотрудника.НоваяТаблицаИзмененияДляОбмена();
	
	Запрос = Новый Запрос;
	// СотрудникиДляОбновленияПубликацииГрафикаОтпусков
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица.Сотрудник КАК Ссылка
	|ИЗ
	|	РегистрСведений.УдалитьСотрудникиДляОбновленияПубликацииГрафикаОтпусков КАК Таблица";
	Таблица = Запрос.Выполнить().Выгрузить();
	Для каждого СтрокаТЗ Из Таблица Цикл
		Если Не ЗначениеЗаполнено(СтрокаТЗ.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = ИзмененияДляОбмена.Добавить();
		НоваяСтрока.Ссылка 				= СтрокаТЗ.Ссылка;
		НоваяСтрока.ТипОбъекта 			= Перечисления.ТипыОбъектовИнтеграцияУправлениеПерсоналом.ГрафикОтпусков;
	КонецЦикла;
		
	// СотрудникиДляОбновленияПубликацииПравНаОтпуск
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.ФизическоеЛицо КАК Ссылка
	|ИЗ
	|	РегистрСведений.УдалитьСотрудникиДляОбновленияПубликацииПравНаОтпуск КАК Таблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО Таблица.Сотрудник = Сотрудники.Ссылка";
	Таблица = Запрос.Выполнить().Выгрузить();
	Для каждого СтрокаТЗ Из Таблица Цикл
		Если Не ЗначениеЗаполнено(СтрокаТЗ.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = ИзмененияДляОбмена.Добавить();
		НоваяСтрока.Ссылка 		= СтрокаТЗ.Ссылка;
		НоваяСтрока.ТипОбъекта 	= Перечисления.ТипыОбъектовИнтеграцияУправлениеПерсоналом.ЗаработанныеПраваНаОтпуск;
	КонецЦикла;
	
	ИзмененияДляОбмена.Свернуть("Ссылка,ТипОбъекта");
	
	Для каждого СтрокаТЗ Из ИзмененияДляОбмена Цикл
		
		НаборЗаписей = РегистрыСведений.ИзмененияДляОбменаКабинетСотрудника.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Ссылка.Установить(СтрокаТЗ.Ссылка); 
		НаборЗаписей.Отбор.ТипОбъекта.Установить(СтрокаТЗ.ТипОбъекта);
		
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.Ссылка 		= СтрокаТЗ.Ссылка;
		ЗаписьНабора.ТипОбъекта 	= СтрокаТЗ.ТипОбъекта;
		ЗаписьНабора.ВерсияДанных 	= Строка(Новый УникальныйИдентификатор);
		
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей); 
		
	КонецЦикла;
	
	РегистрыСведений.УдалитьСотрудникиДляОбновленияПубликацииГрафикаОтпусков.СоздатьНаборЗаписей().Записать();
	РегистрыСведений.УдалитьСотрудникиДляОбновленияПубликацииПравНаОтпуск.СоздатьНаборЗаписей().Записать();
	
КонецПроцедуры

#КонецОбласти

Процедура ПеренестиЗаработанныеПраваНаОтпуск() Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользуетсяСервисКабинетСотрудника") Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Изменения.Ссылка КАК Ссылка,
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо
	|ИЗ
	|	РегистрСведений.ИзмененияДляОбменаКабинетСотрудника КАК Изменения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО Изменения.Ссылка = Сотрудники.Ссылка
	|ГДЕ
	|	Изменения.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовИнтеграцияУправлениеПерсоналом.ЗаработанныеПраваНаОтпуск)";
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеИзменения = РезультатЗапроса.Выгрузить();
	ФизическиеЛица = ОбщегоНазначения.ВыгрузитьКолонку(ТекущиеИзменения, "ФизическоеЛицо", Истина);
	ТипОбъекта = Перечисления.ТипыОбъектовИнтеграцияУправлениеПерсоналом.ЗаработанныеПраваНаОтпуск;
	
	НачатьТранзакцию();
	Попытка
		
		Для каждого СтрокаТЗ Из ТекущиеИзменения Цикл
			НаборЗаписей = РегистрыСведений.ИзмененияДляОбменаКабинетСотрудника.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Ссылка.Установить(СтрокаТЗ.Ссылка);
			НаборЗаписей.Отбор.ТипОбъекта.Установить(ТипОбъекта);
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
		КонецЦикла;
		
		Для каждого ФизическоеЛицо Из ФизическиеЛица Цикл
			НаборЗаписей = РегистрыСведений.ИзмененияДляОбменаКабинетСотрудника.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Ссылка.Установить(ФизическоеЛицо);
			НаборЗаписей.Отбор.ТипОбъекта.Установить(ТипОбъекта);
			ЗаписьНабора = НаборЗаписей.Добавить();
			ЗаписьНабора.Ссылка = ФизическоеЛицо;
			ЗаписьНабора.ТипОбъекта = ТипОбъекта;
			ЗаписьНабора.ВерсияДанных = Строка(Новый УникальныйИдентификатор);
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

Процедура ПеренестиАктуальностьИнформацииОбОтпусках() Экспорт

	Если Не ПолучитьФункциональнуюОпцию("ИспользуетсяСервисКабинетСотрудника") Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	МИНИМУМ(Таблица.ДатаАктуальности) КАК ДатаАктуальности
	|ИЗ
	|	РегистрСведений.УдалитьАктуальностьИнформацииОбОтпуске КАК Таблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО Таблица.Сотрудник = Сотрудники.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Сотрудники.ФизическоеЛицо";
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			НаборЗаписей = РегистрыСведений.АктуальностьИнформацииОбОтпусках.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ФизическоеЛицо.Установить(Выборка.ФизическоеЛицо);
			ЗаписьНабора = НаборЗаписей.Добавить();
			ЗаписьНабора.ФизическоеЛицо 	= Выборка.ФизическоеЛицо;
			ЗаписьНабора.ДатаАктуальности 	= Выборка.ДатаАктуальности;
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
		КонецЦикла;
		
		НаборЗаписей = РегистрыСведений.УдалитьАктуальностьИнформацииОбОтпуске.СоздатьНаборЗаписей();
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

Процедура НастроитьРегламентноеЗаданиеПроверкаАктуальностиЗаработанныхПравНаОтпуск(ПараметрыОбновления = Неопределено) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("ИспользуетсяСервисКабинетСотрудника") Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Ключ", "ПроверкаАктуальностиЗаработанныхПравНаОтпуск");
	Задания = РегламентныеЗаданияСервер.НайтиЗадания(Отбор);
	Если Не ЗначениеЗаполнено(Задания) Или Задания[0].Использование Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ИдентификаторЗадания = РегламентныеЗаданияСервер.УникальныйИдентификатор(Метаданные.РегламентныеЗадания.ПроверкаАктуальностиЗаработанныхПравНаОтпуск);
	ПараметрыЗадания = Новый Структура("Использование", Истина);
	РегламентныеЗаданияСервер.ИзменитьЗадание(ИдентификаторЗадания, ПараметрыЗадания);
	УстановитьПривилегированныйРежим(Ложь);
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);

КонецПроцедуры

Процедура ЗарегистрироватьОбновлениеНастроекФункциональности(ПараметрыОбновления = Неопределено) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("ИспользуетсяСервисКабинетСотрудника") Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&ПоляЗапроса КАК ПоляЗапроса
	|ИЗ
	|	РегистрСведений.НастройкиСервисаКабинетСотрудника КАК НастройкиСервисаКабинетСотрудника
	|ГДЕ
	|	НЕ НастройкиСервисаКабинетСотрудника.ТребуетсяОбновитьНастройкиФункциональности";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПоляЗапроса КАК ПоляЗапроса", "*");
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	ОбработкаВыполнена = Истина;
	Если Выборка.Следующий() Тогда
		
		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "РегистрСведений.НастройкиСервисаКабинетСотрудника", "", "") Тогда
			ОбработкаВыполнена = Ложь;
		Иначе
			
			НаборЗаписей = РегистрыСведений.НастройкиСервисаКабинетСотрудника.СоздатьНаборЗаписей();
			ЗаписьНабора = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(ЗаписьНабора, Выборка);
			ЗаписьНабора.ТребуетсяОбновитьНастройкиФункциональности = Истина;
			
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", ОбработкаВыполнена);

КонецПроцедуры

Процедура ОбновитьРегистрациюСИЗ(ПараметрыОбновления = Неопределено) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("ИспользуетсяСервисКабинетСотрудника")
		Или Не ИнтеграцияКабинетСотрудника.ДоступноИспользованиеСредствИндивидуальнойЗащиты() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВыгружаемыеОбъекты.Ссылка КАК Ссылка
	|ИЗ
	|	РегистрСведений.ВыгружаемыеОбъектыКабинетСотрудника КАК ВыгружаемыеОбъекты
	|ГДЕ
	|	ВыгружаемыеОбъекты.Ссылка ССЫЛКА Справочник.ФизическиеЛица";
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;

	ТипОбъекта = Перечисления.ТипыОбъектовИнтеграцияУправлениеПерсоналом.ИнформацияОСредствахИЗ;
	Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(
			ПараметрыОбновления, "РегистрСведений.ИзмененияДляОбменаКабинетСотрудника", "ТипОбъекта", ТипОбъекта) Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ИзмененияДляОбменаКабинетСотрудника.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ТипОбъекта.Установить(ТипОбъекта);
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.Ссылка 		= Выборка.Ссылка;
		ЗаписьНабора.ТипОбъекта 	= ТипОбъекта;
		ЗаписьНабора.ВерсияДанных 	= Строка(Новый УникальныйИдентификатор);
	КонецЦикла;
	ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);

КонецПроцедуры

Процедура ОбновитьРегистрациюДанныхАнтропометрии(ПараметрыОбновления = Неопределено) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("ИспользуетсяСервисКабинетСотрудника")
		Или Не ИнтеграцияКабинетСотрудника.ДоступноИспользованиеСредствИндивидуальнойЗащиты() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВыгружаемыеОбъекты.Ссылка КАК Ссылка
	|ИЗ
	|	РегистрСведений.ВыгружаемыеОбъектыКабинетСотрудника КАК ВыгружаемыеОбъекты
	|ГДЕ
	|	ВыгружаемыеОбъекты.Ссылка ССЫЛКА Справочник.ФизическиеЛица";
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;

	ТипОбъекта = Перечисления.ТипыОбъектовИнтеграцияУправлениеПерсоналом.Антропометрия;
	Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(
			ПараметрыОбновления, "РегистрСведений.ИзмененияДляОбменаКабинетСотрудника", "ТипОбъекта", ТипОбъекта) Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ИзмененияДляОбменаКабинетСотрудника.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ТипОбъекта.Установить(ТипОбъекта);
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.Ссылка 		= Выборка.Ссылка;
		ЗаписьНабора.ТипОбъекта 	= ТипОбъекта;
		ЗаписьНабора.ВерсияДанных 	= Строка(Новый УникальныйИдентификатор);
	КонецЦикла;
	ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОбмена

Процедура ДополнитьШаблоныДокументов_3_1(Шаблоны) Экспорт
	
	СсылкаПредопределенного = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ШаблоныДокументов.ЗаявлениеНаУчебныйОтпуск");
	Если ЗначениеЗаполнено(СсылкаПредопределенного) Тогда
		Шаблоны.Добавить(СсылкаПредопределенного);
	КонецЕсли;
	
	СсылкаПредопределенного = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ШаблоныДокументов.ЗаявлениеНаОтпускПоУходуЗаРебенком");
	Если ЗначениеЗаполнено(СсылкаПредопределенного) Тогда
		Шаблоны.Добавить(СсылкаПредопределенного);
	КонецЕсли;
	
	СсылкаПредопределенного = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ШаблоныДокументов.ЗаявлениеНаВозвратИзОтпускаПоУходуЗаРебенком");
	Если ЗначениеЗаполнено(СсылкаПредопределенного) Тогда
		Шаблоны.Добавить(СсылкаПредопределенного);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьШаблоныДокументов_3_2(Шаблоны) Экспорт
	
	СсылкаПредопределенного = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ШаблоныДокументов.ИзменениеГрафикаОтпусков");
	Если ЗначениеЗаполнено(СсылкаПредопределенного) Тогда
		Шаблоны.Добавить(СсылкаПредопределенного);
	КонецЕсли;
	
	СсылкаПредопределенного = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ШаблоныДокументов.ЗаявлениеНаИсполнениеГособязанностей");
	Если ЗначениеЗаполнено(СсылкаПредопределенного) Тогда
		Шаблоны.Добавить(СсылкаПредопределенного);
	КонецЕсли;
	
	СсылкаПредопределенного = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ШаблоныДокументов.ЗаявлениеВыходныеДляУходаЗаДетьмиИнвалидами");
	Если ЗначениеЗаполнено(СсылкаПредопределенного) Тогда
		Шаблоны.Добавить(СсылкаПредопределенного);
	КонецЕсли;
	
	СсылкаПредопределенного = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ШаблоныДокументов.ЗаявлениеНаКомандировку");
	Если ЗначениеЗаполнено(СсылкаПредопределенного) Тогда
		Шаблоны.Добавить(СсылкаПредопределенного);
	КонецЕсли;
	
	СсылкаПредопределенного = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ШаблоныДокументов.ОтчетПоКомандировке");
	Если ЗначениеЗаполнено(СсылкаПредопределенного) Тогда
		Шаблоны.Добавить(СсылкаПредопределенного);
	КонецЕсли;
	
	СсылкаПредопределенного = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ШаблоныДокументов.ОтчетРасходыВКомандировке");
	Если ЗначениеЗаполнено(СсылкаПредопределенного) Тогда
		Шаблоны.Добавить(СсылкаПредопределенного);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
